[
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Fugiat consequat aliqua esse sint veniam cupidatat eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Lorem sunt id excepteur quis sit irure dolore sint tempor ad cillum veniam."
      },
      {
        "isCorrect": true,
        "text": "Pariatur exercitation et est commodo commodo incididunt id exercitation incididunt est excepteur."
      },
      {
        "isCorrect": true,
        "text": "Sint aliqua aliqua reprehenderit nulla consectetur et ad exercitation ullamco sunt deserunt."
      },
      {
        "isCorrect": false,
        "text": "Incididunt eu reprehenderit nostrud tempor nostrud mollit sit."
      },
      {
        "isCorrect": true,
        "text": "Et duis occaecat ipsum enim cillum culpa elit laborum dolor in qui nulla."
      },
      {
        "isCorrect": false,
        "text": "Esse magna sint ex commodo anim fugiat dolore aliqua non ipsum minim laboris excepteur laborum."
      },
      {
        "isCorrect": true,
        "text": "Elit velit irure enim occaecat veniam."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Velit magna dolor sit labore culpa duis enim fugiat nostrud proident occaecat.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Excepteur cupidatat proident ut eiusmod occaecat do anim anim aute ipsum ullamco minim."
      },
      {
        "isCorrect": false,
        "text": "Sit sint culpa sint occaecat pariatur ullamco consequat deserunt eu duis fugiat."
      },
      {
        "isCorrect": false,
        "text": "Cupidatat commodo aliquip ullamco veniam."
      },
      {
        "isCorrect": true,
        "text": "Pariatur nisi quis ullamco dolore eiusmod tempor."
      },
      {
        "isCorrect": false,
        "text": "In dolore ex Lorem cillum mollit Lorem."
      },
      {
        "isCorrect": true,
        "text": "Adipisicing minim sint ullamco cupidatat fugiat adipisicing anim est et."
      },
      {
        "isCorrect": true,
        "text": "Nulla id adipisicing nostrud officia sit occaecat do."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Sunt ipsum Lorem id minim esse deserunt.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Ad esse laborum irure incididunt labore ullamco nulla."
      },
      {
        "isCorrect": false,
        "text": "Commodo incididunt incididunt anim enim velit dolore officia pariatur."
      },
      {
        "isCorrect": false,
        "text": "Sit veniam veniam magna exercitation nulla laborum eu anim nulla."
      },
      {
        "isCorrect": true,
        "text": "Consectetur aute consectetur et quis eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Et eu et aute incididunt minim dolore officia elit voluptate aliquip amet qui deserunt."
      },
      {
        "isCorrect": false,
        "text": "Quis fugiat laboris eu duis occaecat Lorem in elit duis fugiat eu dolore veniam."
      },
      {
        "isCorrect": true,
        "text": "Voluptate fugiat deserunt enim occaecat Lorem velit reprehenderit tempor est eu."
      },
      {
        "isCorrect": false,
        "text": "Ea ex ad minim nisi ea sit consequat do."
      },
      {
        "isCorrect": true,
        "text": "Sunt quis aute minim do id minim proident voluptate laborum velit anim qui mollit."
      }
    ],
    "difficulty": 3,
    "text": "Tempor reprehenderit voluptate aliquip qui incididunt incididunt ea Lorem. Qui pariatur mollit id incididunt voluptate mollit. Elit consectetur sit enim labore qui aute. Ipsum dolor aute et mollit sit commodo non fugiat cupidatat magna tempor excepteur. Eu consectetur occaecat dolore est dolore nisi.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Fugiat Lorem nulla dolor magna aliqua mollit exercitation."
      },
      {
        "isCorrect": false,
        "text": "Laborum do laboris quis mollit id cupidatat enim reprehenderit exercitation tempor ullamco fugiat culpa occaecat."
      },
      {
        "isCorrect": true,
        "text": "Aliquip nulla cupidatat mollit ea Lorem aliqua excepteur nulla Lorem consequat anim."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Aliqua labore ea aliquip reprehenderit Lorem et consequat eiusmod veniam. Proident adipisicing quis deserunt id officia ipsum aliquip mollit ex aliquip cillum dolore labore do. Anim cillum do reprehenderit sit sit. Reprehenderit sint commodo et enim mollit.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Velit elit ut aliqua laborum sint ea ad quis est qui quis commodo reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Pariatur proident magna adipisicing aute qui ea."
      },
      {
        "isCorrect": true,
        "text": "Aliquip consectetur ea nostrud dolor sit ipsum nisi sit proident ea consequat."
      },
      {
        "isCorrect": false,
        "text": "In eu exercitation commodo esse do sunt pariatur."
      },
      {
        "isCorrect": true,
        "text": "Mollit officia commodo id laborum laboris non aute."
      },
      {
        "isCorrect": true,
        "text": "Cupidatat pariatur voluptate pariatur enim sint."
      },
      {
        "isCorrect": true,
        "text": "Sunt non voluptate commodo incididunt consectetur nulla enim sint mollit exercitation."
      },
      {
        "isCorrect": false,
        "text": "Laborum esse nulla incididunt qui."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Amet officia occaecat voluptate labore exercitation fugiat irure amet et laborum sunt Lorem sint. Officia consequat dolore incididunt in consequat reprehenderit sint culpa sint magna. Magna incididunt non veniam enim dolor do laborum ipsum tempor tempor. Esse minim amet dolore reprehenderit sit dolor esse amet ullamco excepteur dolor ut culpa in.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Irure magna officia mollit sint id."
      },
      {
        "isCorrect": true,
        "text": "Officia tempor duis deserunt sint."
      },
      {
        "isCorrect": false,
        "text": "Ea labore magna nulla sint id reprehenderit sunt laborum magna."
      },
      {
        "isCorrect": false,
        "text": "Voluptate sit ullamco deserunt eu non ex id non ullamco laboris nostrud quis."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Anim labore sint dolore mollit ad consequat mollit ea aute.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Culpa consequat proident velit dolore anim pariatur."
      },
      {
        "isCorrect": true,
        "text": "Tempor deserunt aliquip excepteur irure."
      },
      {
        "isCorrect": false,
        "text": "Ut nisi non aute cillum enim consectetur ipsum eiusmod duis nostrud irure."
      },
      {
        "isCorrect": false,
        "text": "Proident enim sit quis minim occaecat."
      },
      {
        "isCorrect": false,
        "text": "Pariatur velit dolor ea Lorem nostrud ea adipisicing esse occaecat ipsum qui consequat amet."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod culpa consectetur irure magna."
      },
      {
        "isCorrect": false,
        "text": "Nostrud aute consequat eu dolore eiusmod nulla nisi ea."
      },
      {
        "isCorrect": true,
        "text": "Ut sit velit cupidatat non ipsum esse."
      },
      {
        "isCorrect": false,
        "text": "Cillum labore anim Lorem voluptate ad nostrud culpa in quis proident."
      },
      {
        "isCorrect": true,
        "text": "Ut mollit non ad voluptate."
      }
    ],
    "difficulty": 1,
    "text": "Nulla officia nostrud quis labore cupidatat dolor proident dolor excepteur. Proident culpa non eiusmod nisi laboris nostrud nulla nostrud. Voluptate id officia fugiat ullamco voluptate do id sint esse id in voluptate.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Consequat officia irure ullamco aliquip sit."
      },
      {
        "isCorrect": false,
        "text": "Non enim dolore laboris enim non anim."
      },
      {
        "isCorrect": false,
        "text": "Sit sint ex incididunt ut Lorem veniam est eiusmod ipsum sunt commodo nulla sit."
      },
      {
        "isCorrect": true,
        "text": "Sint enim ullamco ut duis laborum proident nisi cupidatat cupidatat exercitation occaecat elit incididunt."
      },
      {
        "isCorrect": true,
        "text": "Tempor tempor quis esse ipsum."
      },
      {
        "isCorrect": true,
        "text": "Voluptate ut cupidatat ad ea quis enim et amet eu sint."
      },
      {
        "isCorrect": false,
        "text": "Aute labore eu ea veniam reprehenderit Lorem occaecat id."
      },
      {
        "isCorrect": true,
        "text": "Reprehenderit et non ullamco cupidatat."
      },
      {
        "isCorrect": true,
        "text": "Culpa voluptate consequat sint Lorem aliqua dolor dolor consectetur et anim."
      }
    ],
    "difficulty": 0,
    "text": "Qui non ipsum id qui sint cupidatat nostrud.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Quis est laboris consectetur nulla magna cillum."
      },
      {
        "isCorrect": false,
        "text": "Ea enim magna reprehenderit est ut magna non ea adipisicing quis excepteur dolore voluptate nulla."
      },
      {
        "isCorrect": true,
        "text": "Amet occaecat amet id ut."
      },
      {
        "isCorrect": true,
        "text": "Tempor sint nostrud aliqua dolore."
      },
      {
        "isCorrect": false,
        "text": "Non id nisi consectetur consequat qui consectetur laborum excepteur."
      },
      {
        "isCorrect": false,
        "text": "Lorem quis nulla sit eiusmod officia elit dolore deserunt cillum culpa ullamco."
      },
      {
        "isCorrect": true,
        "text": "Excepteur pariatur dolor nulla tempor nisi."
      },
      {
        "isCorrect": true,
        "text": "Commodo anim irure adipisicing aliquip."
      },
      {
        "isCorrect": false,
        "text": "Fugiat magna commodo Lorem enim anim anim nisi et."
      },
      {
        "isCorrect": false,
        "text": "Est eu ex mollit enim."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Mollit cupidatat commodo minim ipsum.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Consectetur qui magna cillum in."
      },
      {
        "isCorrect": false,
        "text": "Eu proident occaecat consequat voluptate esse ea sit consectetur."
      },
      {
        "isCorrect": false,
        "text": "Est ipsum tempor adipisicing esse veniam velit deserunt officia aute eiusmod tempor sunt."
      },
      {
        "isCorrect": false,
        "text": "Et id anim aute excepteur quis sit non non ullamco do cillum fugiat consectetur proident."
      },
      {
        "isCorrect": true,
        "text": "Id est amet ex laboris cillum anim eu consequat qui Lorem fugiat."
      },
      {
        "isCorrect": false,
        "text": "Fugiat ullamco duis in laborum velit pariatur amet ex occaecat ea eiusmod."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Ut eu consequat esse officia enim cupidatat enim cillum ea. Sit esse proident consectetur voluptate incididunt qui id consectetur nulla exercitation non eiusmod. Aliquip elit velit exercitation eiusmod ad elit.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Pariatur elit dolore dolore laboris irure occaecat enim irure voluptate nisi mollit."
      },
      {
        "isCorrect": false,
        "text": "Occaecat laborum dolore aliquip ut ea nostrud tempor in."
      },
      {
        "isCorrect": false,
        "text": "Amet amet voluptate duis est."
      },
      {
        "isCorrect": false,
        "text": "Ullamco laborum commodo qui ut cupidatat commodo sunt commodo."
      },
      {
        "isCorrect": false,
        "text": "Adipisicing exercitation nostrud labore occaecat exercitation enim mollit."
      },
      {
        "isCorrect": true,
        "text": "Pariatur exercitation enim nulla laboris nostrud magna nulla anim esse id esse commodo."
      },
      {
        "isCorrect": false,
        "text": "Amet enim labore consequat mollit minim qui dolore nisi voluptate."
      },
      {
        "isCorrect": false,
        "text": "Dolor ex aliquip veniam anim fugiat duis anim ea ullamco laboris."
      },
      {
        "isCorrect": false,
        "text": "Consequat eiusmod est proident excepteur et ex ut duis officia laborum."
      },
      {
        "isCorrect": false,
        "text": "Irure excepteur incididunt veniam esse mollit excepteur ex."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Culpa laborum non velit reprehenderit esse velit exercitation aliquip. Excepteur ea commodo qui aliquip nisi fugiat enim fugiat exercitation nulla nulla velit quis incididunt. Magna consectetur proident pariatur labore consequat amet. Consequat aliquip labore anim velit esse. In consequat aliquip consequat id ex proident culpa magna occaecat est in nulla nisi.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Ex in ut amet anim nisi eu minim proident minim ipsum adipisicing est ut."
      },
      {
        "isCorrect": true,
        "text": "Enim officia in pariatur mollit qui proident qui labore Lorem nulla ullamco."
      },
      {
        "isCorrect": true,
        "text": "Laboris dolore aliqua ullamco exercitation incididunt."
      },
      {
        "isCorrect": false,
        "text": "Dolore magna mollit adipisicing aliqua ullamco sint fugiat duis irure sunt dolore velit id irure."
      },
      {
        "isCorrect": false,
        "text": "Laboris aliqua veniam laborum aliquip dolore amet sint excepteur qui."
      },
      {
        "isCorrect": false,
        "text": "Exercitation aliqua pariatur proident incididunt minim officia esse quis."
      },
      {
        "isCorrect": false,
        "text": "Esse nulla consequat nostrud nulla pariatur consectetur officia aliquip esse Lorem."
      },
      {
        "isCorrect": false,
        "text": "Amet cupidatat consectetur proident quis labore sint magna sit mollit laboris."
      },
      {
        "isCorrect": false,
        "text": "Amet commodo minim veniam culpa voluptate ipsum aliquip sint fugiat incididunt eiusmod exercitation laborum."
      },
      {
        "isCorrect": true,
        "text": "Aliqua excepteur commodo cupidatat nostrud esse laborum labore veniam id excepteur laborum exercitation dolor id."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Nisi pariatur dolor mollit aute nostrud ut. Mollit do elit aliquip consectetur non eiusmod irure deserunt labore pariatur elit consectetur consequat. Proident pariatur eu id magna. Nulla culpa do aliquip voluptate ex et eu.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Sit tempor aute cillum enim laboris dolore ut labore."
      },
      {
        "isCorrect": false,
        "text": "Est nulla aliqua do amet."
      },
      {
        "isCorrect": true,
        "text": "Adipisicing nostrud ut dolor magna consequat labore consectetur sunt irure esse."
      },
      {
        "isCorrect": false,
        "text": "Deserunt laborum velit enim incididunt amet excepteur qui in cupidatat."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Proident magna sunt incididunt ipsum veniam adipisicing consequat sint sunt duis officia irure duis reprehenderit. Fugiat irure nostrud nisi quis officia. Sunt minim ut dolore consectetur aliquip quis est et eiusmod anim sunt commodo. Ex minim quis esse officia Lorem sint pariatur sint magna ut et laboris. Aliquip tempor quis enim laborum cillum voluptate tempor nostrud id dolor qui do magna. Esse enim officia exercitation pariatur sint et eu enim voluptate. Ea et id dolore velit id proident proident est sunt anim officia eu aliqua eu.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Adipisicing sit sint aliqua qui culpa cupidatat dolore id aliqua adipisicing in pariatur aliquip sunt."
      },
      {
        "isCorrect": false,
        "text": "Esse occaecat deserunt laborum occaecat non est culpa."
      },
      {
        "isCorrect": true,
        "text": "Aute irure cupidatat magna labore deserunt exercitation ex adipisicing sunt ut minim anim pariatur."
      },
      {
        "isCorrect": true,
        "text": "Proident excepteur cupidatat ex sint laboris enim fugiat ut officia."
      },
      {
        "isCorrect": false,
        "text": "Lorem exercitation laborum pariatur fugiat duis."
      },
      {
        "isCorrect": false,
        "text": "Id nisi occaecat magna aute elit commodo aute in."
      },
      {
        "isCorrect": false,
        "text": "Irure nisi nisi ut ullamco in pariatur est veniam adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Et quis dolor ullamco ex cupidatat proident mollit laborum sit ullamco eiusmod amet."
      }
    ],
    "difficulty": 1,
    "text": "Sint officia ea excepteur sunt irure eiusmod laborum.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Velit quis labore ex et aute fugiat."
      },
      {
        "isCorrect": false,
        "text": "Proident sunt tempor aliquip aliqua elit."
      },
      {
        "isCorrect": false,
        "text": "Duis magna qui dolor et."
      },
      {
        "isCorrect": true,
        "text": "Irure consequat occaecat deserunt consequat."
      },
      {
        "isCorrect": false,
        "text": "Reprehenderit aliquip eiusmod eu ut culpa magna."
      },
      {
        "isCorrect": false,
        "text": "Quis quis proident mollit nostrud nisi commodo nostrud minim voluptate aute culpa quis."
      },
      {
        "isCorrect": false,
        "text": "Do id sunt in voluptate enim amet mollit enim."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod laborum ad officia ex veniam aute officia."
      },
      {
        "isCorrect": true,
        "text": "Anim proident nisi magna sit enim ut dolor qui adipisicing culpa irure ea."
      },
      {
        "isCorrect": false,
        "text": "Minim cillum pariatur ipsum aliqua officia adipisicing duis nulla reprehenderit laboris."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Exercitation pariatur quis occaecat incididunt esse dolor labore voluptate consectetur. Eu consequat fugiat veniam aute id dolor ad commodo non excepteur sit excepteur laboris. Id in quis consequat eiusmod minim culpa laborum aliquip voluptate eiusmod aute culpa sit. Exercitation enim pariatur velit ullamco ut amet deserunt laborum amet velit.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "In non qui laborum magna elit velit labore sit."
      },
      {
        "isCorrect": true,
        "text": "Occaecat non ut cupidatat aliquip cupidatat est incididunt anim ullamco reprehenderit et est."
      },
      {
        "isCorrect": true,
        "text": "Consectetur consectetur labore nisi nostrud adipisicing reprehenderit nostrud."
      }
    ],
    "difficulty": 3,
    "text": "Veniam et veniam incididunt commodo cillum ex ipsum eiusmod veniam occaecat.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Proident ut cupidatat ex commodo aliqua Lorem aliquip."
      },
      {
        "isCorrect": false,
        "text": "Laborum mollit reprehenderit eiusmod enim eiusmod voluptate pariatur ut duis."
      },
      {
        "isCorrect": true,
        "text": "Laboris adipisicing magna tempor anim sit consequat proident culpa non."
      },
      {
        "isCorrect": false,
        "text": "Ullamco cillum occaecat et nulla ipsum est."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Ea sit commodo dolore consectetur quis ea exercitation tempor culpa culpa duis irure. Culpa culpa nulla Lorem ex consequat. Laborum ad amet consectetur proident adipisicing ex dolore in consectetur. In ipsum quis laborum duis mollit culpa minim. Voluptate nostrud non laboris nulla deserunt adipisicing. Lorem ex aute ea laboris sit tempor.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Do duis magna laboris anim velit."
      },
      {
        "isCorrect": false,
        "text": "Esse aliquip id dolor esse eiusmod."
      },
      {
        "isCorrect": false,
        "text": "Aliquip nulla ut voluptate fugiat nostrud veniam non quis aute ipsum officia ipsum."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Consectetur consectetur et consequat cillum quis labore commodo nulla.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Fugiat nisi laboris consequat tempor aute culpa adipisicing."
      },
      {
        "isCorrect": true,
        "text": "Elit reprehenderit sunt proident reprehenderit et ut magna ullamco quis qui eu."
      },
      {
        "isCorrect": true,
        "text": "Veniam esse excepteur incididunt culpa ad reprehenderit."
      },
      {
        "isCorrect": true,
        "text": "Ad nulla id ad id commodo veniam minim ut dolore do et irure ullamco."
      },
      {
        "isCorrect": false,
        "text": "Eu magna aliquip occaecat nisi qui cillum in ex mollit commodo dolore."
      },
      {
        "isCorrect": true,
        "text": "Excepteur duis qui irure Lorem magna quis."
      },
      {
        "isCorrect": true,
        "text": "Id cupidatat nostrud enim adipisicing anim voluptate veniam."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Velit culpa in quis duis irure adipisicing pariatur.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Lorem officia ullamco deserunt amet in duis irure sint et sit occaecat adipisicing elit magna."
      },
      {
        "isCorrect": true,
        "text": "Sint veniam consequat adipisicing est ipsum do."
      },
      {
        "isCorrect": true,
        "text": "Ipsum et aliquip ad magna aliquip irure qui fugiat sint aliqua elit aliqua aute fugiat."
      },
      {
        "isCorrect": false,
        "text": "Et est non incididunt tempor laborum."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Irure Lorem irure fugiat dolor amet ad proident voluptate tempor fugiat deserunt.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Exercitation tempor fugiat dolore dolor."
      },
      {
        "isCorrect": false,
        "text": "Consequat nostrud deserunt enim exercitation nisi sint consectetur ipsum Lorem tempor id."
      },
      {
        "isCorrect": false,
        "text": "Lorem cupidatat nisi esse laborum Lorem."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Qui magna nulla consequat proident nulla ullamco sunt Lorem consectetur labore laborum esse sit officia. Cillum eiusmod excepteur pariatur sit id magna tempor ipsum deserunt aliqua anim aliquip sunt. Consectetur culpa sint Lorem occaecat ad cupidatat incididunt tempor nulla. Velit est eu eiusmod elit magna. Velit occaecat dolore esse irure esse cillum labore in deserunt eiusmod excepteur do amet sint. Amet officia pariatur enim id consequat ad incididunt non fugiat.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Exercitation consectetur dolor aute ut veniam ex anim."
      },
      {
        "isCorrect": false,
        "text": "Proident sunt in commodo cillum tempor tempor pariatur."
      },
      {
        "isCorrect": false,
        "text": "Velit et et exercitation nostrud excepteur sit non voluptate sint."
      },
      {
        "isCorrect": false,
        "text": "Amet enim sit mollit ullamco amet qui esse."
      },
      {
        "isCorrect": false,
        "text": "Aliqua ullamco ex nisi cupidatat Lorem deserunt sint tempor enim veniam et."
      },
      {
        "isCorrect": false,
        "text": "Magna magna qui eiusmod pariatur."
      },
      {
        "isCorrect": false,
        "text": "Mollit elit commodo qui ea tempor."
      }
    ],
    "difficulty": 2,
    "text": "Eiusmod ad adipisicing qui amet aute.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Eu do consectetur do commodo nulla sunt laborum mollit nostrud cupidatat fugiat consequat."
      },
      {
        "isCorrect": false,
        "text": "Tempor amet proident nisi consectetur do dolor est dolore irure."
      },
      {
        "isCorrect": true,
        "text": "Velit reprehenderit pariatur est sint."
      },
      {
        "isCorrect": false,
        "text": "Eu nisi aliqua pariatur non do commodo amet adipisicing eiusmod."
      },
      {
        "isCorrect": false,
        "text": "Minim officia tempor in ad."
      },
      {
        "isCorrect": true,
        "text": "Ex laboris officia et nisi dolor quis ad commodo esse labore aliquip anim incididunt."
      },
      {
        "isCorrect": false,
        "text": "Magna eu aliquip minim anim duis elit adipisicing exercitation veniam cillum dolor nostrud nulla."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Labore nostrud voluptate anim officia cillum dolore voluptate ex Lorem velit eu.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Tempor duis ut consectetur elit enim consequat nisi aute esse nostrud nulla anim."
      },
      {
        "isCorrect": false,
        "text": "Est ex cillum elit tempor reprehenderit ullamco ea amet ullamco commodo aute velit nisi cillum."
      },
      {
        "isCorrect": true,
        "text": "Laborum Lorem incididunt culpa in fugiat occaecat voluptate amet ipsum laboris ipsum veniam."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Tempor aliqua labore aute occaecat.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Lorem ex est deserunt voluptate ipsum enim nulla est."
      },
      {
        "isCorrect": false,
        "text": "Et est sit aute irure non in ut fugiat consectetur do velit do."
      },
      {
        "isCorrect": false,
        "text": "Minim sit occaecat reprehenderit in consequat culpa mollit dolore est id."
      },
      {
        "isCorrect": true,
        "text": "Nulla quis consequat voluptate labore est ut sint voluptate voluptate."
      },
      {
        "isCorrect": true,
        "text": "Officia do nisi cillum ex ut quis do occaecat eiusmod."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Do adipisicing amet pariatur ipsum duis voluptate fugiat id eu nisi qui.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Sint non mollit irure incididunt."
      },
      {
        "isCorrect": false,
        "text": "Lorem excepteur aliqua dolor cillum id aliqua tempor proident."
      },
      {
        "isCorrect": false,
        "text": "Irure magna ad elit proident ex veniam tempor."
      },
      {
        "isCorrect": false,
        "text": "Minim nisi aliqua Lorem ex aliquip sit elit reprehenderit nisi sint."
      },
      {
        "isCorrect": false,
        "text": "Amet consequat id anim incididunt elit consequat quis."
      },
      {
        "isCorrect": false,
        "text": "Non officia consectetur laborum et dolor ad aliqua culpa labore."
      },
      {
        "isCorrect": true,
        "text": "Laboris ut do reprehenderit quis occaecat eu eu aliqua cupidatat."
      },
      {
        "isCorrect": false,
        "text": "Magna nisi dolor ad et reprehenderit esse minim enim tempor ex eu eu nulla anim."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Dolore aute eu ad labore labore consequat ut voluptate nisi deserunt in.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Labore anim voluptate consequat irure cillum consequat magna ut commodo fugiat deserunt dolor."
      },
      {
        "isCorrect": false,
        "text": "Laboris est labore qui incididunt eiusmod deserunt."
      },
      {
        "isCorrect": true,
        "text": "Sint sit minim aliqua ut qui sint velit ea."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Magna ex quis amet et dolor nostrud elit occaecat tempor est velit elit.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Nisi veniam culpa dolor deserunt tempor ex nostrud minim laborum."
      },
      {
        "isCorrect": false,
        "text": "Ea nisi sit id sunt est sit minim proident sunt."
      },
      {
        "isCorrect": true,
        "text": "Dolor mollit officia et Lorem Lorem ullamco."
      },
      {
        "isCorrect": true,
        "text": "Dolor eu magna adipisicing laborum cupidatat sunt adipisicing cillum culpa veniam laborum exercitation dolor sit."
      },
      {
        "isCorrect": true,
        "text": "Ad veniam eu laborum qui reprehenderit exercitation cillum dolore aliquip et excepteur tempor."
      },
      {
        "isCorrect": true,
        "text": "Sint laborum est cupidatat pariatur."
      },
      {
        "isCorrect": true,
        "text": "Consectetur fugiat enim enim reprehenderit est consequat nostrud non ex ea fugiat ea."
      }
    ],
    "difficulty": 1,
    "text": "Minim irure culpa commodo elit eu exercitation eu duis Lorem anim. Laborum dolor ipsum voluptate sunt reprehenderit. Elit do ex aute non pariatur duis quis excepteur.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Ea exercitation do reprehenderit elit reprehenderit et cupidatat cupidatat officia incididunt aliqua non labore do."
      },
      {
        "isCorrect": false,
        "text": "Qui proident ipsum aliquip consectetur occaecat pariatur ullamco mollit incididunt minim velit."
      },
      {
        "isCorrect": false,
        "text": "Anim Lorem sit aliqua sint aute proident sint minim eu."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Ullamco nisi aliqua dolore dolore nostrud sunt voluptate ad quis. Laboris officia cupidatat consectetur voluptate aliqua laboris. Enim non ipsum tempor non laboris magna sunt in.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Enim commodo reprehenderit amet duis sint quis nostrud dolore fugiat mollit mollit."
      },
      {
        "isCorrect": true,
        "text": "Deserunt ipsum consectetur qui reprehenderit sit ullamco laborum labore commodo."
      },
      {
        "isCorrect": true,
        "text": "Proident esse adipisicing velit nostrud dolore irure occaecat cillum."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Laborum id amet do sint irure proident.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Cupidatat sunt amet eu deserunt tempor anim."
      },
      {
        "isCorrect": false,
        "text": "Ut occaecat magna incididunt ullamco voluptate commodo exercitation incididunt cillum."
      },
      {
        "isCorrect": true,
        "text": "Eu incididunt est irure nisi."
      },
      {
        "isCorrect": false,
        "text": "Occaecat laborum est velit officia non exercitation irure culpa quis."
      },
      {
        "isCorrect": false,
        "text": "Ipsum eu et laboris officia."
      },
      {
        "isCorrect": true,
        "text": "Labore Lorem enim occaecat fugiat esse ipsum Lorem et velit."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Eiusmod incididunt esse laborum enim incididunt velit consectetur sit cupidatat Lorem elit do occaecat. Nulla duis enim nisi et adipisicing labore duis est proident nostrud laboris commodo cillum. Consequat minim aute irure quis ad sint. Non proident culpa labore duis eu magna in elit velit fugiat eiusmod eu aliqua. Culpa eu aliqua labore consectetur do. Aliquip veniam mollit amet amet non fugiat exercitation cupidatat ullamco consequat velit nulla excepteur.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Incididunt ex deserunt anim non commodo ipsum quis consequat."
      },
      {
        "isCorrect": true,
        "text": "Aliquip commodo dolore et ullamco mollit esse proident."
      },
      {
        "isCorrect": true,
        "text": "Nisi incididunt excepteur sunt in nostrud."
      },
      {
        "isCorrect": true,
        "text": "Officia fugiat sit sit commodo dolor in adipisicing."
      },
      {
        "isCorrect": true,
        "text": "Elit ea culpa fugiat exercitation consectetur do ullamco officia excepteur sit."
      },
      {
        "isCorrect": false,
        "text": "Labore est velit irure ex quis dolor."
      },
      {
        "isCorrect": false,
        "text": "Proident labore veniam eiusmod elit occaecat eu duis aliquip ex eu elit officia."
      }
    ],
    "difficulty": 3,
    "text": "Exercitation amet proident veniam et esse ex proident quis dolore.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Commodo pariatur est culpa consectetur culpa sit."
      },
      {
        "isCorrect": false,
        "text": "In officia nulla tempor aliquip occaecat et consectetur esse veniam occaecat duis occaecat deserunt qui."
      },
      {
        "isCorrect": true,
        "text": "Voluptate aute voluptate quis consectetur nostrud qui enim et aute."
      },
      {
        "isCorrect": false,
        "text": "In nisi aute eiusmod tempor cupidatat."
      },
      {
        "isCorrect": false,
        "text": "Irure ullamco ea dolor ut aliquip commodo aliqua est proident dolor cillum ipsum."
      },
      {
        "isCorrect": false,
        "text": "Aliqua duis sint culpa deserunt reprehenderit labore ullamco enim in aute."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Consequat qui sint qui pariatur aliqua nisi fugiat officia id occaecat id eu.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Mollit do in laboris culpa sit ad tempor."
      },
      {
        "isCorrect": false,
        "text": "Et magna id non cillum amet eiusmod dolore."
      },
      {
        "isCorrect": false,
        "text": "Tempor est excepteur mollit esse esse adipisicing ut eiusmod velit nisi enim ut elit."
      },
      {
        "isCorrect": true,
        "text": "Ad aliqua pariatur nulla ut ex pariatur eiusmod voluptate sunt."
      },
      {
        "isCorrect": true,
        "text": "Sunt magna fugiat aliqua aute deserunt excepteur anim cillum irure dolor consequat nostrud veniam."
      },
      {
        "isCorrect": false,
        "text": "Sint aliquip pariatur esse duis tempor ut ipsum."
      },
      {
        "isCorrect": false,
        "text": "Fugiat occaecat incididunt Lorem magna dolore culpa consectetur quis dolor ad excepteur nulla eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Labore esse voluptate quis ipsum in quis culpa qui exercitation cupidatat ipsum."
      },
      {
        "isCorrect": true,
        "text": "Eu quis anim dolore sit."
      },
      {
        "isCorrect": false,
        "text": "Id quis consectetur occaecat officia ut id cillum."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Culpa aute elit mollit dolor do labore id adipisicing aute esse.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Tempor consectetur reprehenderit cillum nisi est anim sunt amet aliquip dolore ut sit dolore non."
      },
      {
        "isCorrect": true,
        "text": "Magna occaecat elit incididunt esse culpa et occaecat."
      },
      {
        "isCorrect": true,
        "text": "Minim eu nisi reprehenderit est."
      },
      {
        "isCorrect": false,
        "text": "Excepteur ad quis fugiat fugiat ex amet cillum veniam sit."
      },
      {
        "isCorrect": false,
        "text": "Et non adipisicing adipisicing velit quis aliqua quis magna id Lorem reprehenderit do ad enim."
      },
      {
        "isCorrect": true,
        "text": "Anim ullamco culpa labore Lorem ipsum dolor."
      },
      {
        "isCorrect": false,
        "text": "Nulla commodo aliqua quis esse ea excepteur aute nulla consequat duis."
      },
      {
        "isCorrect": true,
        "text": "Anim nulla minim duis exercitation cillum."
      }
    ],
    "difficulty": 0,
    "text": "Ad aute tempor labore qui eiusmod dolor voluptate exercitation adipisicing et ad.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Qui incididunt culpa Lorem nostrud ea officia dolore sint proident pariatur amet."
      },
      {
        "isCorrect": true,
        "text": "Est anim quis ea laborum reprehenderit consequat."
      },
      {
        "isCorrect": true,
        "text": "Laborum laboris mollit velit fugiat velit voluptate officia sit quis ad."
      },
      {
        "isCorrect": true,
        "text": "Aliqua culpa anim in occaecat magna exercitation aliquip ullamco laboris in non."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Reprehenderit ipsum incididunt nostrud aliquip ut exercitation enim fugiat irure laborum cupidatat aliqua adipisicing.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Voluptate magna in sunt duis."
      },
      {
        "isCorrect": false,
        "text": "Irure quis commodo exercitation esse dolore laborum ea velit tempor dolore irure ullamco laboris labore."
      },
      {
        "isCorrect": false,
        "text": "Consectetur excepteur elit officia duis consectetur tempor qui."
      },
      {
        "isCorrect": false,
        "text": "Nisi dolore id Lorem exercitation eu anim est mollit est labore."
      },
      {
        "isCorrect": false,
        "text": "Est incididunt ad ea cillum anim voluptate laboris excepteur culpa non nisi ea exercitation."
      },
      {
        "isCorrect": false,
        "text": "Duis mollit officia labore adipisicing consectetur sit quis sit."
      },
      {
        "isCorrect": true,
        "text": "Mollit magna proident do dolore qui commodo sunt eu id pariatur non non."
      },
      {
        "isCorrect": false,
        "text": "Tempor ad duis anim enim ipsum duis duis esse magna anim culpa."
      },
      {
        "isCorrect": true,
        "text": "Pariatur eiusmod deserunt Lorem cupidatat duis nulla eiusmod est deserunt id aliqua."
      },
      {
        "isCorrect": true,
        "text": "Qui amet eiusmod culpa ex aute."
      }
    ],
    "difficulty": 0,
    "text": "Sunt exercitation cupidatat ullamco ex anim pariatur ad aute officia magna duis aliqua labore.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Enim ullamco dolor dolor adipisicing quis ex do."
      },
      {
        "isCorrect": true,
        "text": "Proident qui commodo incididunt veniam non incididunt aliqua."
      },
      {
        "isCorrect": true,
        "text": "Consequat consequat sint et elit deserunt quis sint excepteur consectetur nostrud nostrud eu."
      },
      {
        "isCorrect": false,
        "text": "Magna et dolore ipsum id consectetur dolore."
      },
      {
        "isCorrect": true,
        "text": "Amet Lorem ad aliqua eiusmod labore proident dolor ex velit Lorem velit velit Lorem reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Id sit culpa deserunt voluptate laborum qui id adipisicing excepteur esse tempor adipisicing minim."
      },
      {
        "isCorrect": true,
        "text": "Anim occaecat consectetur cillum officia adipisicing ipsum sint ipsum eiusmod."
      },
      {
        "isCorrect": false,
        "text": "Incididunt enim nostrud mollit exercitation ea proident excepteur elit commodo est mollit do tempor enim."
      },
      {
        "isCorrect": false,
        "text": "Et ex cupidatat minim dolor deserunt quis ad in nostrud proident exercitation est laboris incididunt."
      },
      {
        "isCorrect": true,
        "text": "Nostrud ex sit excepteur enim reprehenderit officia eiusmod et."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Ullamco elit aliquip reprehenderit nisi.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Do velit laborum in eu magna nisi est ad laborum deserunt."
      },
      {
        "isCorrect": false,
        "text": "Commodo minim sint anim consectetur irure."
      },
      {
        "isCorrect": false,
        "text": "Eu amet culpa mollit aliqua officia proident qui quis ipsum deserunt irure ullamco enim dolore."
      },
      {
        "isCorrect": false,
        "text": "Fugiat esse ullamco aliquip non sunt labore."
      },
      {
        "isCorrect": true,
        "text": "Aute sit labore sit in nostrud pariatur voluptate."
      },
      {
        "isCorrect": false,
        "text": "Velit sit tempor nostrud qui velit aute dolor eu incididunt ipsum."
      },
      {
        "isCorrect": true,
        "text": "Pariatur proident laborum aliqua ut incididunt ut esse."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Non amet voluptate tempor proident magna dolore commodo cupidatat minim.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Irure consectetur qui id reprehenderit laboris ullamco deserunt excepteur sit est."
      },
      {
        "isCorrect": false,
        "text": "Non labore labore dolore mollit Lorem quis elit nostrud."
      },
      {
        "isCorrect": false,
        "text": "Duis tempor occaecat sint laborum dolore enim Lorem sunt."
      },
      {
        "isCorrect": true,
        "text": "Labore elit fugiat excepteur nulla ex reprehenderit aute minim et aliquip proident fugiat."
      },
      {
        "isCorrect": false,
        "text": "Elit cillum ipsum ex cillum."
      },
      {
        "isCorrect": true,
        "text": "Fugiat sit est amet ipsum ad sunt id esse nostrud eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Eu esse consequat ut est amet dolor aliqua ut amet sint sit cillum."
      },
      {
        "isCorrect": false,
        "text": "Esse ex commodo ipsum anim pariatur exercitation sint eu anim culpa tempor fugiat cupidatat."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Ea tempor nisi in excepteur est enim aliqua mollit adipisicing culpa velit consectetur.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Est adipisicing fugiat exercitation est anim occaecat anim ut cillum."
      },
      {
        "isCorrect": true,
        "text": "Ea excepteur non excepteur enim irure nulla velit nisi fugiat et occaecat proident irure tempor."
      },
      {
        "isCorrect": false,
        "text": "Do sit labore in culpa eiusmod est nostrud non irure deserunt irure."
      },
      {
        "isCorrect": false,
        "text": "Elit labore eiusmod eiusmod mollit laborum."
      },
      {
        "isCorrect": true,
        "text": "Et eu laborum elit enim labore velit sint Lorem duis nisi amet irure magna do."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Proident eu ex velit irure non quis irure tempor ullamco ut laboris.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ad eiusmod consectetur dolor officia velit cillum."
      },
      {
        "isCorrect": true,
        "text": "Consectetur dolore minim velit elit laborum aliqua reprehenderit id cupidatat nulla irure ullamco voluptate amet."
      },
      {
        "isCorrect": false,
        "text": "Ut velit do magna commodo fugiat minim ea excepteur."
      },
      {
        "isCorrect": true,
        "text": "Deserunt deserunt quis ut tempor velit culpa aute cillum occaecat quis ipsum."
      },
      {
        "isCorrect": true,
        "text": "Adipisicing ut et qui culpa id enim."
      },
      {
        "isCorrect": false,
        "text": "Fugiat incididunt irure qui dolore nulla do cillum dolor aliqua tempor."
      },
      {
        "isCorrect": true,
        "text": "Aliquip cillum adipisicing velit et eu nostrud deserunt veniam."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Occaecat adipisicing pariatur ipsum laborum magna ex eu laboris nisi non. Aute sunt laborum ut sint quis veniam cillum. Excepteur incididunt laborum irure laboris sint aliqua aute exercitation id ut tempor. Mollit nostrud et nisi reprehenderit dolore ea duis officia irure proident excepteur sint sint mollit.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Veniam reprehenderit et commodo ex est sit."
      },
      {
        "isCorrect": false,
        "text": "Culpa magna magna consectetur esse in dolore duis irure occaecat ea quis labore."
      },
      {
        "isCorrect": true,
        "text": "Qui mollit proident nostrud veniam ut sint et nostrud esse occaecat ipsum."
      },
      {
        "isCorrect": false,
        "text": "Pariatur velit nisi minim culpa anim ex reprehenderit incididunt."
      },
      {
        "isCorrect": true,
        "text": "Sit sit velit sit magna et."
      },
      {
        "isCorrect": false,
        "text": "Dolore mollit id est anim proident anim officia est eu laborum eiusmod velit velit."
      },
      {
        "isCorrect": true,
        "text": "Aliquip nisi ipsum adipisicing labore minim sit dolore irure mollit ullamco minim aliqua eu."
      },
      {
        "isCorrect": false,
        "text": "Mollit consectetur fugiat cupidatat pariatur esse voluptate dolor dolore laborum."
      },
      {
        "isCorrect": true,
        "text": "Consectetur ad incididunt sunt et occaecat tempor aliquip irure eu proident fugiat fugiat nostrud deserunt."
      },
      {
        "isCorrect": false,
        "text": "Sunt ullamco ut laborum excepteur enim deserunt nostrud esse nisi."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Dolor anim magna anim elit culpa laboris adipisicing minim consequat et ullamco nostrud id.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Labore ullamco elit non voluptate duis sit eiusmod mollit et eu."
      },
      {
        "isCorrect": true,
        "text": "Dolore enim non elit dolor."
      },
      {
        "isCorrect": true,
        "text": "Sit sint consectetur magna non minim in cillum reprehenderit nostrud in adipisicing cupidatat."
      },
      {
        "isCorrect": true,
        "text": "Non do pariatur sit in aliqua quis ad voluptate."
      },
      {
        "isCorrect": false,
        "text": "Mollit ea ad laboris occaecat consequat."
      },
      {
        "isCorrect": true,
        "text": "Anim eiusmod ipsum et irure sint Lorem cillum minim tempor incididunt magna."
      },
      {
        "isCorrect": true,
        "text": "Exercitation tempor non aliquip magna."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Id quis excepteur ad duis.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ut ut aute veniam nulla adipisicing id minim occaecat cupidatat laborum minim nisi."
      },
      {
        "isCorrect": true,
        "text": "Officia Lorem sint minim cillum velit ipsum exercitation velit ex."
      },
      {
        "isCorrect": true,
        "text": "Nulla esse excepteur esse adipisicing adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Enim excepteur irure eiusmod fugiat adipisicing officia aute qui dolore qui aliquip veniam ullamco."
      },
      {
        "isCorrect": false,
        "text": "Cupidatat dolore nostrud labore amet proident consectetur."
      },
      {
        "isCorrect": true,
        "text": "Tempor ex amet anim laboris enim dolore proident esse est ullamco culpa."
      },
      {
        "isCorrect": true,
        "text": "Minim qui officia labore veniam aute nisi eu nostrud voluptate laboris et duis consectetur."
      },
      {
        "isCorrect": false,
        "text": "Excepteur culpa deserunt fugiat incididunt aute aliquip pariatur dolore dolore."
      },
      {
        "isCorrect": true,
        "text": "Ipsum consectetur in veniam nisi exercitation eu pariatur."
      },
      {
        "isCorrect": true,
        "text": "Velit velit duis anim esse ad sit culpa ex eiusmod nulla laboris nisi anim."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Fugiat excepteur in magna ut nulla do minim voluptate qui sint excepteur ad ex.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Pariatur ut ipsum Lorem fugiat eu."
      },
      {
        "isCorrect": true,
        "text": "Aute labore pariatur consectetur ea cillum."
      },
      {
        "isCorrect": true,
        "text": "Dolore sint ullamco ex qui veniam officia labore ex duis ipsum proident est amet do."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Id esse esse minim pariatur ullamco eiusmod laboris esse tempor quis adipisicing do incididunt. Irure sit consequat exercitation sunt ullamco pariatur consectetur magna eiusmod. Enim anim sunt sint aliqua aute nisi exercitation reprehenderit ullamco culpa sit cupidatat nostrud velit. Nisi amet ad commodo in esse dolore pariatur exercitation pariatur adipisicing culpa ex pariatur aliqua. Quis eiusmod deserunt pariatur ipsum proident qui nisi anim adipisicing pariatur adipisicing. Id pariatur magna et anim cillum elit duis non amet ullamco fugiat. Mollit aute labore nulla dolore proident in ullamco et ipsum elit nisi voluptate.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Proident anim culpa exercitation occaecat nisi sunt fugiat magna adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Labore fugiat est pariatur amet nisi labore exercitation id."
      },
      {
        "isCorrect": false,
        "text": "Nisi incididunt incididunt qui consectetur do qui nisi tempor est ipsum ad sit."
      },
      {
        "isCorrect": true,
        "text": "Officia est id commodo tempor nulla exercitation quis esse."
      },
      {
        "isCorrect": true,
        "text": "Sunt veniam irure et aliquip ex do voluptate dolor."
      },
      {
        "isCorrect": true,
        "text": "Id excepteur nisi officia cupidatat."
      },
      {
        "isCorrect": false,
        "text": "Sint labore eu et ullamco sit."
      },
      {
        "isCorrect": true,
        "text": "Ex magna incididunt in id deserunt sit incididunt veniam labore do ex deserunt."
      },
      {
        "isCorrect": false,
        "text": "Laboris anim ipsum ullamco deserunt adipisicing aute."
      },
      {
        "isCorrect": true,
        "text": "Laborum cillum est veniam excepteur aute sunt amet mollit voluptate ut dolor ut."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Eiusmod reprehenderit officia incididunt ex sint.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Excepteur sunt occaecat commodo eiusmod laborum commodo veniam irure reprehenderit et."
      },
      {
        "isCorrect": false,
        "text": "Quis reprehenderit est amet nostrud cillum cupidatat."
      },
      {
        "isCorrect": true,
        "text": "Laboris nisi fugiat esse ea velit duis ut et velit ea aliqua nulla irure."
      },
      {
        "isCorrect": false,
        "text": "Elit Lorem culpa sunt est veniam amet enim."
      },
      {
        "isCorrect": true,
        "text": "Laboris tempor aute ea cillum quis in mollit proident culpa laborum."
      },
      {
        "isCorrect": false,
        "text": "Culpa esse duis minim adipisicing aliquip."
      },
      {
        "isCorrect": false,
        "text": "Occaecat esse do voluptate duis ea aliqua cillum voluptate."
      },
      {
        "isCorrect": true,
        "text": "Et id labore pariatur sint laboris occaecat ex sunt fugiat aute exercitation cupidatat ea voluptate."
      },
      {
        "isCorrect": false,
        "text": "Veniam laboris exercitation cupidatat excepteur nulla dolor."
      },
      {
        "isCorrect": false,
        "text": "Et officia fugiat non in sit qui sit deserunt veniam commodo excepteur laboris."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Id qui ut esse irure sint do adipisicing cillum laboris pariatur in deserunt mollit ad.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Aliqua est eiusmod elit qui magna."
      },
      {
        "isCorrect": false,
        "text": "Fugiat aliquip nostrud excepteur ea velit proident nisi eiusmod sunt adipisicing magna ipsum anim."
      },
      {
        "isCorrect": false,
        "text": "Irure nisi amet Lorem sit dolor."
      },
      {
        "isCorrect": false,
        "text": "Id aute irure nulla sit velit."
      },
      {
        "isCorrect": false,
        "text": "Ad commodo laborum ullamco deserunt aute eu in aliqua ea anim dolore ad."
      },
      {
        "isCorrect": true,
        "text": "In duis culpa ipsum ullamco duis."
      }
    ],
    "difficulty": 2,
    "text": "Elit culpa enim ea ex non. Duis exercitation nulla minim fugiat velit voluptate voluptate voluptate laboris. Commodo dolor laboris ipsum voluptate ex ullamco ad laboris cupidatat officia commodo incididunt. Veniam ipsum deserunt voluptate et anim consectetur aliquip est excepteur mollit nulla duis ad amet. Et ut minim consectetur culpa voluptate aute tempor aute irure excepteur ex et reprehenderit pariatur.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Dolor tempor aute proident magna ex non."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod minim nulla Lorem dolor elit ex adipisicing consectetur veniam sit exercitation laborum amet."
      },
      {
        "isCorrect": true,
        "text": "Irure proident exercitation veniam ullamco voluptate duis."
      },
      {
        "isCorrect": true,
        "text": "Ullamco laboris aliquip consequat ea elit nulla."
      },
      {
        "isCorrect": false,
        "text": "Velit ullamco ullamco Lorem anim magna in enim cillum consectetur anim Lorem culpa sit mollit."
      },
      {
        "isCorrect": true,
        "text": "Ex nisi id pariatur do amet incididunt qui."
      }
    ],
    "difficulty": 0,
    "text": "Cillum voluptate est exercitation duis duis excepteur mollit fugiat ea.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Adipisicing quis voluptate sint pariatur aliqua non velit commodo esse aute tempor et aliqua deserunt."
      },
      {
        "isCorrect": true,
        "text": "Exercitation cupidatat anim incididunt exercitation anim."
      },
      {
        "isCorrect": true,
        "text": "Amet amet aliqua esse elit aliqua reprehenderit dolor deserunt non ut."
      },
      {
        "isCorrect": false,
        "text": "Commodo fugiat duis non exercitation qui voluptate consectetur nisi nulla do."
      }
    ],
    "difficulty": 1,
    "text": "Amet ullamco et quis amet velit adipisicing ut. Reprehenderit duis esse ut qui laboris. Laborum pariatur sunt reprehenderit quis aute mollit proident enim laborum proident commodo veniam enim ea. Sint veniam ad proident do exercitation et minim.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Id ipsum aliquip veniam nisi veniam aliqua."
      },
      {
        "isCorrect": false,
        "text": "Quis velit non labore aliqua id ad laboris ut."
      },
      {
        "isCorrect": false,
        "text": "Sunt fugiat consectetur eiusmod velit tempor nulla velit sunt deserunt adipisicing proident laboris."
      },
      {
        "isCorrect": false,
        "text": "Elit minim reprehenderit in veniam anim minim id exercitation ipsum in proident veniam."
      },
      {
        "isCorrect": false,
        "text": "Deserunt Lorem et velit dolor minim nisi nostrud ea pariatur dolor elit elit duis tempor."
      },
      {
        "isCorrect": true,
        "text": "Eu ad duis laboris est sunt elit."
      },
      {
        "isCorrect": true,
        "text": "Aliqua laborum et Lorem in nulla ipsum est."
      }
    ],
    "difficulty": 2,
    "text": "Consequat sint culpa et dolore sint enim pariatur sit incididunt mollit id.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Commodo Lorem occaecat do aliqua nulla Lorem ullamco culpa labore commodo veniam."
      },
      {
        "isCorrect": true,
        "text": "Mollit labore ex enim pariatur labore aliquip."
      },
      {
        "isCorrect": true,
        "text": "Cillum ullamco irure in esse qui ea quis dolor anim adipisicing."
      },
      {
        "isCorrect": true,
        "text": "Eiusmod aliqua tempor exercitation ex ex."
      },
      {
        "isCorrect": true,
        "text": "Sunt excepteur eu nostrud in elit aute velit dolore sit cillum."
      },
      {
        "isCorrect": false,
        "text": "Aute ex minim occaecat Lorem minim anim ullamco esse cupidatat aliqua aute in dolore."
      },
      {
        "isCorrect": true,
        "text": "Minim sit ea adipisicing culpa sunt ut dolor qui adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Minim incididunt nulla dolor ipsum labore nisi pariatur tempor est minim cupidatat laboris dolor dolore."
      }
    ],
    "difficulty": 2,
    "text": "Irure ex magna occaecat culpa officia elit sunt aliqua commodo. Ipsum velit minim excepteur cillum. Laboris laborum ullamco voluptate cupidatat Lorem. Excepteur sint tempor adipisicing veniam nostrud Lorem proident nisi sit tempor aute duis in quis.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Cupidatat aliquip occaecat commodo minim aliquip excepteur cillum aliqua."
      },
      {
        "isCorrect": false,
        "text": "Laborum occaecat sit elit eiusmod anim."
      },
      {
        "isCorrect": true,
        "text": "Dolore elit id veniam adipisicing nisi irure est velit anim sit."
      },
      {
        "isCorrect": true,
        "text": "Commodo veniam culpa Lorem id eu minim occaecat non aliqua voluptate duis excepteur amet."
      },
      {
        "isCorrect": true,
        "text": "Laboris nulla pariatur ex adipisicing cupidatat nostrud dolore et exercitation commodo nostrud velit aliquip."
      },
      {
        "isCorrect": false,
        "text": "Enim reprehenderit laboris qui in in consequat Lorem qui ullamco proident laboris."
      },
      {
        "isCorrect": false,
        "text": "Anim ullamco exercitation culpa qui laborum magna veniam aliquip occaecat reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Magna aliquip sunt officia nulla aliqua nostrud incididunt pariatur ullamco proident et."
      },
      {
        "isCorrect": false,
        "text": "Sunt ad aliqua ea ea dolor consectetur anim et nisi est Lorem eiusmod laboris."
      },
      {
        "isCorrect": false,
        "text": "Quis magna consectetur eu dolor non minim minim."
      }
    ],
    "difficulty": 3,
    "text": "Do quis ut nulla amet culpa cupidatat enim magna. Fugiat nostrud in deserunt esse cillum laboris veniam velit dolore excepteur minim tempor. Cillum in nulla esse ut aliquip sint amet sit veniam cillum quis sint cupidatat eu. Magna est quis esse commodo cillum proident Lorem laboris excepteur ad. Ex occaecat quis sit minim magna sunt elit nulla consequat. Esse culpa dolore excepteur exercitation occaecat sint est sint non. Do cillum duis nisi eiusmod exercitation irure cillum reprehenderit tempor adipisicing minim.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Ullamco ut aute esse et nisi proident dolore anim sint mollit sint reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Duis excepteur reprehenderit esse non veniam excepteur."
      },
      {
        "isCorrect": true,
        "text": "Sint ipsum est velit magna quis velit."
      },
      {
        "isCorrect": false,
        "text": "Id nulla veniam exercitation elit irure commodo."
      },
      {
        "isCorrect": true,
        "text": "Eiusmod quis eu ut sint incididunt eu ad."
      },
      {
        "isCorrect": false,
        "text": "Lorem id ad commodo nulla sit ullamco."
      },
      {
        "isCorrect": true,
        "text": "Sint aute aliquip eiusmod sunt voluptate."
      },
      {
        "isCorrect": false,
        "text": "Occaecat adipisicing eu eiusmod et ullamco consequat."
      },
      {
        "isCorrect": false,
        "text": "Mollit ea non velit dolor sint nulla sint dolor do id culpa."
      },
      {
        "isCorrect": false,
        "text": "Elit consectetur et minim amet duis dolore aliqua dolor."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Esse magna aliqua culpa adipisicing eiusmod irure sunt esse cillum pariatur proident mollit ea eiusmod. Nostrud est veniam eu ut aute culpa reprehenderit ut velit. Non irure duis culpa sint. Cupidatat amet culpa et sunt cillum ullamco qui sint magna officia tempor deserunt occaecat laboris.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Adipisicing ipsum excepteur culpa proident esse minim elit sit eiusmod voluptate non mollit adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Esse dolore excepteur anim in proident labore est non et Lorem excepteur et."
      },
      {
        "isCorrect": false,
        "text": "Sunt exercitation occaecat ex aute sint exercitation qui enim tempor eiusmod id."
      },
      {
        "isCorrect": true,
        "text": "Id esse veniam nisi aliqua aliquip tempor eu incididunt magna."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Veniam proident laborum aute officia duis qui reprehenderit ad aliquip ipsum minim mollit. Sunt aute qui voluptate veniam eu. Quis eu dolore eiusmod sint. Occaecat laboris consequat mollit voluptate incididunt ullamco consequat dolore cillum. Consectetur tempor sit elit eu. Non eu sunt non ut pariatur sit voluptate cillum quis velit consequat enim. Lorem incididunt magna eiusmod laboris reprehenderit id tempor irure id id Lorem.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Consectetur amet culpa ea ut aliqua duis tempor ad minim tempor in tempor."
      },
      {
        "isCorrect": true,
        "text": "Voluptate aute et ea labore eu ipsum labore duis qui eu."
      },
      {
        "isCorrect": true,
        "text": "Proident anim exercitation reprehenderit occaecat."
      },
      {
        "isCorrect": false,
        "text": "Lorem consequat dolore sint esse do irure quis pariatur labore aliqua."
      },
      {
        "isCorrect": true,
        "text": "Enim Lorem culpa laboris reprehenderit dolor."
      },
      {
        "isCorrect": false,
        "text": "Elit dolore sint magna mollit aute aliquip consectetur reprehenderit do adipisicing sit ea."
      },
      {
        "isCorrect": false,
        "text": "Mollit ullamco laboris dolor laboris cupidatat consequat excepteur eu cupidatat dolor dolor anim."
      }
    ],
    "difficulty": 3,
    "text": "Laboris irure est deserunt ad aliqua quis incididunt labore aliqua labore.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Do non sint irure ea amet."
      },
      {
        "isCorrect": false,
        "text": "Exercitation sint anim mollit et sit et nisi aliquip."
      },
      {
        "isCorrect": false,
        "text": "Consectetur aute eu magna nisi cupidatat officia nulla."
      },
      {
        "isCorrect": false,
        "text": "Ad aute reprehenderit cupidatat sint dolor ut fugiat velit nulla."
      },
      {
        "isCorrect": true,
        "text": "Cupidatat pariatur ullamco elit aliquip aliqua."
      }
    ],
    "difficulty": 3,
    "text": "In mollit ut aute dolor qui sint proident.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Exercitation elit voluptate aute voluptate excepteur et irure incididunt deserunt anim adipisicing ad exercitation ad."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod sit dolor ut excepteur qui ut eiusmod do sit aliquip magna."
      },
      {
        "isCorrect": true,
        "text": "Id ea mollit veniam sit do laborum in in fugiat sint dolore incididunt."
      },
      {
        "isCorrect": false,
        "text": "Consectetur ea tempor Lorem in pariatur sint qui id excepteur eu quis exercitation."
      }
    ],
    "difficulty": 2,
    "text": "Sit excepteur fugiat sunt officia tempor aliqua do.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Eiusmod aliquip ex qui magna nostrud dolore non in cillum sit id adipisicing in et."
      },
      {
        "isCorrect": true,
        "text": "Veniam excepteur ipsum ut nostrud esse consequat duis Lorem aute culpa."
      },
      {
        "isCorrect": false,
        "text": "Veniam dolor et non officia tempor amet ullamco tempor enim sunt excepteur."
      },
      {
        "isCorrect": false,
        "text": "Reprehenderit eu quis aliquip quis esse et cupidatat quis dolore exercitation fugiat duis in."
      },
      {
        "isCorrect": true,
        "text": "Incididunt excepteur labore ex commodo nisi pariatur consequat tempor mollit eu eiusmod cupidatat in duis."
      },
      {
        "isCorrect": false,
        "text": "Veniam amet cillum proident cillum."
      },
      {
        "isCorrect": false,
        "text": "Voluptate qui ullamco consectetur nostrud ad."
      },
      {
        "isCorrect": false,
        "text": "Id duis non est magna dolore laborum dolore."
      },
      {
        "isCorrect": true,
        "text": "Laboris cupidatat eiusmod esse culpa reprehenderit non irure sint magna nulla excepteur enim."
      },
      {
        "isCorrect": false,
        "text": "Nulla sint anim Lorem amet qui ex eu reprehenderit quis ut aliqua reprehenderit culpa."
      }
    ],
    "difficulty": 3,
    "text": "Est cupidatat consectetur eiusmod veniam Lorem. Eu nostrud dolore dolor enim fugiat reprehenderit exercitation excepteur sit enim incididunt ex. Veniam cillum quis aliqua nostrud.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Fugiat reprehenderit qui fugiat ipsum eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Esse non in magna aliquip do sint Lorem quis ad cillum ullamco."
      },
      {
        "isCorrect": true,
        "text": "Reprehenderit exercitation commodo anim nostrud excepteur labore amet consectetur."
      },
      {
        "isCorrect": false,
        "text": "Duis cupidatat sunt ea cupidatat dolore labore culpa nulla ex cillum."
      },
      {
        "isCorrect": false,
        "text": "Officia ullamco quis cillum cillum non labore do culpa esse ex."
      },
      {
        "isCorrect": false,
        "text": "Excepteur elit ad et nostrud in culpa amet quis anim labore ullamco dolore proident deserunt."
      },
      {
        "isCorrect": false,
        "text": "Aute officia id enim deserunt duis commodo nostrud pariatur."
      },
      {
        "isCorrect": true,
        "text": "Cillum quis et sint exercitation elit dolor eiusmod enim."
      }
    ],
    "difficulty": 0,
    "text": "Non sint aliqua dolore adipisicing amet id ea et excepteur sint deserunt velit.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Adipisicing laboris id velit tempor."
      },
      {
        "isCorrect": false,
        "text": "Nisi deserunt ipsum id id occaecat Lorem ut eiusmod in excepteur cillum ut proident."
      },
      {
        "isCorrect": true,
        "text": "Laboris aute exercitation enim ullamco veniam culpa eu aliquip est."
      },
      {
        "isCorrect": true,
        "text": "Sint consectetur nulla nostrud labore velit anim deserunt."
      },
      {
        "isCorrect": false,
        "text": "Ad veniam Lorem laborum aliqua reprehenderit nostrud sunt est adipisicing labore ad culpa deserunt occaecat."
      },
      {
        "isCorrect": true,
        "text": "Amet sit sunt ullamco et et officia excepteur esse nulla ad voluptate."
      },
      {
        "isCorrect": true,
        "text": "Tempor veniam esse amet deserunt eiusmod non deserunt deserunt."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Consequat mollit est cillum esse anim velit non et.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Adipisicing nisi esse enim anim occaecat adipisicing nisi commodo laboris."
      },
      {
        "isCorrect": true,
        "text": "Amet ullamco enim sint quis sunt proident laboris sunt ex aliqua magna."
      },
      {
        "isCorrect": true,
        "text": "Et esse cillum pariatur sint laborum enim."
      }
    ],
    "difficulty": 0,
    "text": "Aute id mollit eu culpa sint excepteur id.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Enim enim veniam exercitation deserunt amet dolor sit et non occaecat cupidatat consectetur mollit."
      },
      {
        "isCorrect": false,
        "text": "Elit nisi amet aliqua reprehenderit proident sit."
      },
      {
        "isCorrect": false,
        "text": "Non enim in occaecat duis culpa do occaecat officia consequat commodo et culpa."
      },
      {
        "isCorrect": false,
        "text": "Laborum aliqua pariatur voluptate aliqua do minim labore Lorem et nostrud."
      },
      {
        "isCorrect": true,
        "text": "Aliquip dolor fugiat enim ullamco amet Lorem sit pariatur proident quis mollit cupidatat officia."
      },
      {
        "isCorrect": true,
        "text": "Eu sit nulla duis irure proident sunt officia laboris."
      },
      {
        "isCorrect": true,
        "text": "Quis nisi pariatur in in elit laboris mollit nulla."
      },
      {
        "isCorrect": true,
        "text": "Lorem mollit exercitation laboris do dolore nisi sunt laborum fugiat commodo qui irure nostrud."
      },
      {
        "isCorrect": true,
        "text": "Deserunt minim nisi aliquip ex dolore qui."
      }
    ],
    "difficulty": 1,
    "text": "Ea laboris velit commodo Lorem.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ullamco occaecat Lorem aliquip non sint fugiat do aute dolor esse aute."
      },
      {
        "isCorrect": true,
        "text": "In pariatur dolor nisi laborum."
      },
      {
        "isCorrect": true,
        "text": "Esse quis cillum et non officia irure minim ut id nisi pariatur."
      },
      {
        "isCorrect": true,
        "text": "Adipisicing aliquip cillum pariatur anim ad occaecat ad id Lorem irure labore ullamco minim."
      },
      {
        "isCorrect": true,
        "text": "Aliquip velit dolore cupidatat officia."
      },
      {
        "isCorrect": true,
        "text": "Voluptate fugiat et labore do veniam enim id cupidatat do voluptate dolor nisi."
      },
      {
        "isCorrect": true,
        "text": "Nulla fugiat Lorem irure ex."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Ea excepteur Lorem fugiat consequat laboris tempor exercitation proident do dolore aute reprehenderit sit mollit.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Cillum id veniam ea sit in veniam officia ut dolor officia Lorem."
      },
      {
        "isCorrect": false,
        "text": "Velit consectetur ea quis ut duis sit."
      },
      {
        "isCorrect": true,
        "text": "Ullamco nisi magna ut laborum."
      },
      {
        "isCorrect": true,
        "text": "Quis officia commodo eiusmod incididunt anim ea laboris."
      },
      {
        "isCorrect": false,
        "text": "Adipisicing irure dolor sit nisi mollit voluptate amet eu sit sint veniam voluptate reprehenderit ullamco."
      },
      {
        "isCorrect": true,
        "text": "Consequat enim aliqua irure nostrud fugiat consequat esse aliqua mollit mollit non consectetur."
      },
      {
        "isCorrect": true,
        "text": "Non Lorem elit veniam nulla occaecat irure fugiat cillum eu pariatur."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Proident et deserunt dolore aliqua eiusmod voluptate dolor eu magna. Et ullamco aliqua et qui Lorem reprehenderit veniam esse magna ad ad ad. Ut irure cillum tempor officia esse nostrud do est nisi ea ex consectetur. Eiusmod aliqua in ipsum officia esse deserunt consequat consequat. In et esse ad deserunt.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Do reprehenderit minim quis culpa ex ipsum in qui eu cupidatat."
      },
      {
        "isCorrect": false,
        "text": "Sunt duis excepteur laboris sunt velit in exercitation labore aliquip ea incididunt irure quis et."
      },
      {
        "isCorrect": true,
        "text": "Ipsum magna dolore ipsum tempor cupidatat nisi ex enim."
      },
      {
        "isCorrect": false,
        "text": "Lorem sint nostrud fugiat non aliquip aliqua cupidatat dolor."
      },
      {
        "isCorrect": true,
        "text": "Ullamco velit do aliqua ipsum et voluptate."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Non pariatur nostrud eiusmod aliquip aute mollit do ipsum magna sit. Aliqua dolor cillum occaecat duis minim eiusmod pariatur pariatur labore minim eiusmod eu ullamco sint. Exercitation do elit ad in consequat reprehenderit proident.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Nisi cupidatat enim consequat voluptate ipsum in amet ullamco adipisicing esse aliquip id."
      },
      {
        "isCorrect": false,
        "text": "Quis anim aliquip ea proident quis nulla ipsum ullamco magna."
      },
      {
        "isCorrect": false,
        "text": "Enim est id sunt commodo duis aliqua cillum dolor."
      },
      {
        "isCorrect": true,
        "text": "Consectetur reprehenderit et consequat dolor ut laboris cillum do."
      },
      {
        "isCorrect": true,
        "text": "Lorem laborum aliquip Lorem sint ea aliquip cillum."
      },
      {
        "isCorrect": true,
        "text": "Anim voluptate incididunt amet fugiat do culpa enim culpa aliquip deserunt."
      },
      {
        "isCorrect": false,
        "text": "Quis culpa aliquip ullamco non elit nostrud esse fugiat deserunt magna amet ipsum ex elit."
      },
      {
        "isCorrect": true,
        "text": "Nostrud Lorem sunt mollit fugiat nulla enim magna dolor non."
      },
      {
        "isCorrect": true,
        "text": "Aute sit quis culpa sit adipisicing duis non cupidatat ut consequat laborum."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Eiusmod anim incididunt aliqua anim magna officia eiusmod elit dolore.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Exercitation dolor consequat eu sint qui."
      },
      {
        "isCorrect": true,
        "text": "Incididunt tempor consequat ut dolor consectetur ullamco exercitation sit ut eu consequat."
      },
      {
        "isCorrect": false,
        "text": "Aute nostrud Lorem sint irure cillum eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Mollit et nostrud magna dolore dolore ex exercitation."
      },
      {
        "isCorrect": false,
        "text": "Et est aliquip id irure pariatur do adipisicing."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Occaecat Lorem fugiat minim officia fugiat id ex esse non. Elit excepteur consequat irure amet velit mollit occaecat nisi do voluptate nisi mollit dolore. Qui culpa culpa aute laborum occaecat. Occaecat ea non consectetur Lorem aute. Esse aute dolor reprehenderit do fugiat deserunt. Magna laboris officia reprehenderit Lorem.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Et aliquip dolore ex cillum sunt."
      },
      {
        "isCorrect": false,
        "text": "Deserunt voluptate labore duis ad anim consectetur quis."
      },
      {
        "isCorrect": false,
        "text": "Sint minim aliqua culpa nulla."
      },
      {
        "isCorrect": false,
        "text": "Voluptate sint dolore et dolor non nisi veniam ipsum consequat commodo excepteur."
      },
      {
        "isCorrect": false,
        "text": "Id dolore do nisi qui duis aliquip sit reprehenderit occaecat est exercitation aliqua exercitation."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Dolore reprehenderit esse pariatur ut ad mollit mollit sint culpa irure consectetur ut.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Aute fugiat ipsum voluptate mollit eiusmod et."
      },
      {
        "isCorrect": false,
        "text": "Ex laborum sint Lorem magna."
      },
      {
        "isCorrect": true,
        "text": "Et nisi et nulla et cillum deserunt incididunt commodo qui culpa sint."
      },
      {
        "isCorrect": false,
        "text": "Mollit ut adipisicing dolor consectetur ex consectetur voluptate cillum anim cupidatat."
      },
      {
        "isCorrect": false,
        "text": "Laboris sit pariatur ex culpa aute exercitation occaecat laborum anim officia magna nostrud consectetur."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod ipsum incididunt ad eu eiusmod ullamco incididunt."
      },
      {
        "isCorrect": true,
        "text": "Est excepteur ipsum aliqua occaecat ut aliqua laborum ea."
      },
      {
        "isCorrect": false,
        "text": "Labore et est aliquip esse pariatur est anim aliqua nulla culpa mollit consequat est."
      },
      {
        "isCorrect": true,
        "text": "Veniam consequat nisi non ullamco enim eu deserunt labore nisi fugiat qui laborum."
      }
    ],
    "difficulty": 3,
    "text": "Duis eiusmod ex minim esse consectetur aliqua Lorem do non nisi. Duis aliquip aliquip aliquip velit do cupidatat laborum nulla. Culpa ex incididunt pariatur do dolor pariatur deserunt. Duis Lorem pariatur incididunt anim elit qui officia dolore ipsum magna officia in amet amet. Eu qui laborum amet reprehenderit laboris culpa velit ipsum qui. Esse culpa voluptate enim irure qui.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Quis Lorem eu excepteur esse exercitation exercitation velit reprehenderit Lorem nulla ad."
      },
      {
        "isCorrect": false,
        "text": "Dolor commodo ea nostrud quis deserunt velit elit."
      },
      {
        "isCorrect": true,
        "text": "Eiusmod nisi aliqua qui anim dolore sunt sit officia ad."
      },
      {
        "isCorrect": false,
        "text": "Voluptate reprehenderit cillum esse est tempor."
      },
      {
        "isCorrect": true,
        "text": "Sit dolor tempor aute sunt duis."
      },
      {
        "isCorrect": true,
        "text": "Id sint ipsum fugiat nulla eu proident aliqua et velit adipisicing sint anim minim magna."
      },
      {
        "isCorrect": true,
        "text": "Veniam veniam esse magna irure in voluptate do esse exercitation pariatur tempor."
      },
      {
        "isCorrect": false,
        "text": "Consequat eiusmod minim occaecat non nulla occaecat nulla occaecat duis."
      },
      {
        "isCorrect": false,
        "text": "Dolore occaecat duis proident proident nisi officia aliquip nostrud quis."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Reprehenderit est qui tempor incididunt sit sint aute aliquip veniam velit proident qui enim culpa.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Sint et ullamco nostrud id eu."
      },
      {
        "isCorrect": false,
        "text": "Sunt sit magna ex ea excepteur culpa ipsum cillum aute enim non excepteur dolor id."
      },
      {
        "isCorrect": false,
        "text": "Irure esse cupidatat occaecat enim commodo in cupidatat ipsum dolor mollit cupidatat occaecat esse exercitation."
      },
      {
        "isCorrect": true,
        "text": "Pariatur ipsum commodo ex fugiat."
      },
      {
        "isCorrect": false,
        "text": "Elit sit elit dolor reprehenderit deserunt laboris."
      },
      {
        "isCorrect": true,
        "text": "Reprehenderit sit esse consequat ut anim cupidatat duis sint."
      },
      {
        "isCorrect": false,
        "text": "Pariatur ea aliqua deserunt Lorem."
      },
      {
        "isCorrect": true,
        "text": "Dolor dolor ea dolor dolor duis excepteur sit cupidatat sit."
      },
      {
        "isCorrect": false,
        "text": "Ea anim pariatur consequat aliquip elit exercitation officia id sint do sint laboris quis nisi."
      },
      {
        "isCorrect": true,
        "text": "Minim do anim mollit Lorem voluptate Lorem dolore cupidatat quis ipsum eu."
      }
    ],
    "difficulty": 2,
    "text": "Enim consectetur ut nisi ea enim occaecat aute esse eiusmod. Consequat labore non ipsum adipisicing adipisicing pariatur ipsum. Laboris ipsum elit in nulla sunt nisi adipisicing.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Aute proident do velit aliquip cillum excepteur anim dolore tempor."
      },
      {
        "isCorrect": true,
        "text": "Consectetur pariatur cupidatat irure nostrud ea non mollit aliqua excepteur et ullamco in eu."
      },
      {
        "isCorrect": false,
        "text": "Enim elit proident anim Lorem laborum sunt nulla magna duis."
      },
      {
        "isCorrect": true,
        "text": "Ex commodo aute ex velit labore."
      },
      {
        "isCorrect": true,
        "text": "Aliquip velit consequat ipsum fugiat ad aliquip aliquip in non."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Veniam esse ea reprehenderit et et in reprehenderit nulla esse occaecat reprehenderit.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Quis cupidatat sunt id exercitation culpa veniam consectetur tempor ullamco nostrud."
      },
      {
        "isCorrect": true,
        "text": "Eiusmod exercitation proident ex minim."
      },
      {
        "isCorrect": true,
        "text": "Lorem ex occaecat do quis aute aliqua non aute."
      },
      {
        "isCorrect": false,
        "text": "Ullamco proident laborum labore aliqua nostrud cillum mollit quis et exercitation magna."
      },
      {
        "isCorrect": true,
        "text": "Culpa cupidatat excepteur et tempor laborum exercitation dolore laboris irure id."
      },
      {
        "isCorrect": false,
        "text": "Fugiat irure ea quis nisi consequat velit voluptate amet nulla adipisicing veniam nulla."
      },
      {
        "isCorrect": true,
        "text": "Est magna ad labore quis laboris dolore ut ea nostrud commodo non consequat nulla eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Velit tempor et laboris excepteur mollit in sit."
      },
      {
        "isCorrect": true,
        "text": "Velit amet cillum deserunt occaecat ut elit cillum minim voluptate."
      },
      {
        "isCorrect": true,
        "text": "Fugiat sit labore quis occaecat ad eiusmod esse irure ut cupidatat in."
      }
    ],
    "difficulty": 2,
    "text": "Ut nostrud consequat mollit officia aliquip pariatur reprehenderit aute ex ad dolore.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Labore ipsum do elit adipisicing dolore dolor quis."
      },
      {
        "isCorrect": false,
        "text": "Irure cillum dolore laboris id non sunt commodo."
      },
      {
        "isCorrect": false,
        "text": "Duis non in minim minim non enim voluptate et eu cupidatat enim laborum."
      },
      {
        "isCorrect": false,
        "text": "Ex aute veniam cillum fugiat adipisicing ad id ullamco."
      },
      {
        "isCorrect": false,
        "text": "Culpa nostrud amet ex non magna labore deserunt enim quis consectetur cupidatat."
      }
    ],
    "difficulty": 1,
    "text": "Sint esse mollit nulla velit exercitation et.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Ipsum est laboris eu officia aliqua consectetur."
      },
      {
        "isCorrect": false,
        "text": "Quis in irure mollit officia duis esse."
      },
      {
        "isCorrect": false,
        "text": "Esse Lorem ea anim labore enim sunt id."
      },
      {
        "isCorrect": false,
        "text": "In dolor incididunt irure sunt pariatur proident incididunt amet mollit labore."
      },
      {
        "isCorrect": true,
        "text": "Amet consequat enim reprehenderit est."
      },
      {
        "isCorrect": false,
        "text": "Magna veniam aliqua consectetur Lorem."
      },
      {
        "isCorrect": true,
        "text": "Excepteur incididunt enim id eu amet esse."
      },
      {
        "isCorrect": true,
        "text": "Mollit reprehenderit fugiat deserunt consectetur consectetur amet consectetur id commodo aliqua excepteur."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Ullamco id deserunt sint amet mollit ad minim id sint.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Occaecat sit nisi deserunt eu veniam veniam magna occaecat est."
      },
      {
        "isCorrect": true,
        "text": "Mollit enim veniam duis non proident ullamco eiusmod aute esse sunt sunt sint."
      },
      {
        "isCorrect": true,
        "text": "Duis ipsum dolore labore esse cupidatat."
      },
      {
        "isCorrect": true,
        "text": "Sint veniam sit aliqua sit proident commodo in amet est enim exercitation nostrud amet et."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod exercitation mollit reprehenderit elit culpa esse laboris irure elit culpa aliqua anim eiusmod aliquip."
      },
      {
        "isCorrect": false,
        "text": "Dolore consectetur quis reprehenderit magna sunt pariatur magna anim eu amet culpa."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Cupidatat velit aute sit id consequat deserunt nulla commodo Lorem ullamco ullamco.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "In laborum aute reprehenderit nostrud exercitation ipsum esse ut qui do velit in."
      },
      {
        "isCorrect": true,
        "text": "Id qui eiusmod aliquip proident duis laboris tempor."
      },
      {
        "isCorrect": true,
        "text": "Occaecat reprehenderit duis in est nostrud veniam dolore mollit."
      },
      {
        "isCorrect": true,
        "text": "Veniam pariatur do culpa aute aliquip aute eiusmod nulla minim commodo aliquip."
      },
      {
        "isCorrect": false,
        "text": "Ex amet commodo ex pariatur officia nulla magna reprehenderit nulla."
      },
      {
        "isCorrect": false,
        "text": "Amet excepteur quis et veniam elit dolor labore aliqua."
      },
      {
        "isCorrect": true,
        "text": "Sint deserunt velit amet fugiat incididunt enim nulla."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Sunt nisi minim dolore proident minim magna fugiat cillum excepteur. Non commodo non occaecat veniam voluptate exercitation non aliqua. Elit aute veniam quis mollit nostrud quis id tempor ipsum aute ullamco sunt ipsum exercitation. Qui et ad est deserunt aliquip ex cupidatat qui quis cillum.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Enim eiusmod exercitation consectetur do."
      },
      {
        "isCorrect": true,
        "text": "Magna anim irure laboris reprehenderit tempor nulla eu aliqua nisi."
      },
      {
        "isCorrect": false,
        "text": "Magna aliqua fugiat exercitation velit est nostrud ut consequat culpa esse laborum reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Mollit officia non exercitation sint velit laborum."
      },
      {
        "isCorrect": true,
        "text": "Veniam tempor nulla voluptate excepteur nostrud nulla nostrud ea commodo incididunt."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Proident voluptate reprehenderit amet nulla duis anim veniam in.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Esse proident ad id nisi qui ullamco eiusmod ex anim in."
      },
      {
        "isCorrect": false,
        "text": "Cillum nisi veniam tempor laboris sint ea aliqua id."
      },
      {
        "isCorrect": true,
        "text": "Mollit commodo ad commodo quis aliquip nisi non enim culpa minim consequat et ea velit."
      },
      {
        "isCorrect": false,
        "text": "Non do eiusmod dolore id ullamco ex ut irure anim eu id eiusmod."
      },
      {
        "isCorrect": false,
        "text": "In nulla laborum dolore aliqua adipisicing."
      },
      {
        "isCorrect": true,
        "text": "Dolor reprehenderit Lorem officia cupidatat ea voluptate et cillum esse."
      },
      {
        "isCorrect": true,
        "text": "Do eu anim ipsum dolore culpa irure et ipsum incididunt do amet labore anim eu."
      },
      {
        "isCorrect": false,
        "text": "Consectetur magna ullamco commodo minim."
      },
      {
        "isCorrect": true,
        "text": "Est adipisicing deserunt minim eiusmod nostrud sit."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Ut ex nulla dolor ad aliqua cupidatat fugiat.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ea ipsum veniam anim ea ad id eu mollit cupidatat excepteur ex."
      },
      {
        "isCorrect": false,
        "text": "Dolore occaecat sit elit in excepteur quis culpa excepteur esse dolor."
      },
      {
        "isCorrect": true,
        "text": "Velit eu commodo cillum nulla non sunt ut id veniam ex."
      },
      {
        "isCorrect": true,
        "text": "Et aliqua deserunt cupidatat ipsum tempor officia officia proident pariatur eu exercitation."
      },
      {
        "isCorrect": true,
        "text": "Dolor voluptate enim consequat consectetur ex culpa do do deserunt Lorem aliquip culpa est."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Reprehenderit commodo est do proident eiusmod sunt sunt cupidatat quis Lorem pariatur amet reprehenderit. Irure sunt ut velit eiusmod fugiat aliqua ullamco laborum nostrud labore nulla. Elit minim incididunt eiusmod aute ut consectetur et mollit ea exercitation deserunt nostrud. Aute elit non do minim laborum minim eiusmod elit ad. Nulla enim ad dolor exercitation voluptate ea fugiat ad nulla cillum cupidatat eiusmod.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Id sint proident occaecat tempor reprehenderit minim reprehenderit ipsum."
      },
      {
        "isCorrect": false,
        "text": "Aute incididunt cillum culpa consequat pariatur voluptate commodo tempor aute adipisicing aute qui ad."
      },
      {
        "isCorrect": true,
        "text": "Dolor id incididunt esse adipisicing aliqua qui consectetur officia veniam magna magna aliquip."
      },
      {
        "isCorrect": false,
        "text": "Velit aliquip enim laborum consectetur."
      },
      {
        "isCorrect": false,
        "text": "Reprehenderit officia enim mollit irure occaecat aute."
      },
      {
        "isCorrect": true,
        "text": "Mollit fugiat et ut amet."
      },
      {
        "isCorrect": true,
        "text": "Aute nostrud eiusmod ullamco consequat labore eiusmod duis sint."
      },
      {
        "isCorrect": false,
        "text": "Culpa reprehenderit sunt minim et adipisicing sunt pariatur non veniam eu."
      }
    ],
    "difficulty": 1,
    "text": "Cupidatat ut pariatur sint fugiat irure culpa pariatur ad.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Id nostrud quis non anim aliquip anim reprehenderit et."
      },
      {
        "isCorrect": false,
        "text": "Occaecat ullamco duis excepteur incididunt consequat magna excepteur."
      },
      {
        "isCorrect": false,
        "text": "Ullamco consectetur incididunt amet et proident fugiat do ullamco mollit labore."
      },
      {
        "isCorrect": true,
        "text": "Ea sint pariatur eiusmod labore veniam duis anim ea quis ad laborum deserunt."
      },
      {
        "isCorrect": false,
        "text": "Culpa commodo irure officia sunt do cupidatat fugiat sit est duis aute qui."
      }
    ],
    "difficulty": 1,
    "text": "Non eiusmod aute id quis consectetur irure.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Nisi laborum sunt veniam reprehenderit id pariatur reprehenderit adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Pariatur ea ex pariatur irure voluptate qui dolor ad."
      },
      {
        "isCorrect": false,
        "text": "Aliqua cillum ullamco laborum culpa minim ut ea minim quis deserunt aliqua amet."
      },
      {
        "isCorrect": true,
        "text": "Culpa do id id proident."
      },
      {
        "isCorrect": true,
        "text": "Sit mollit laborum officia ipsum."
      },
      {
        "isCorrect": false,
        "text": "Amet Lorem laboris excepteur aute tempor tempor elit."
      },
      {
        "isCorrect": false,
        "text": "Ullamco consectetur culpa eu ipsum adipisicing."
      },
      {
        "isCorrect": false,
        "text": "Magna pariatur anim sunt ad eu est laboris magna."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Pariatur irure irure do velit ipsum mollit occaecat. Consequat pariatur eu proident sint in do. Lorem laborum officia ut minim sunt sit aliquip ad. Velit fugiat nostrud nostrud velit dolor minim ea consectetur occaecat ex irure aliqua dolor. Cupidatat magna eu culpa consectetur do cupidatat laborum sint enim. Excepteur occaecat irure velit excepteur ullamco.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Cupidatat culpa aliqua laboris adipisicing laboris dolore do dolore ipsum culpa commodo ad."
      },
      {
        "isCorrect": false,
        "text": "Anim minim sit et labore do consequat qui et pariatur cillum ipsum sit sunt sunt."
      },
      {
        "isCorrect": true,
        "text": "Ipsum adipisicing et dolor Lorem aute."
      },
      {
        "isCorrect": true,
        "text": "Duis veniam exercitation dolore veniam commodo dolore adipisicing elit ullamco consequat sint irure."
      },
      {
        "isCorrect": false,
        "text": "Officia incididunt consectetur fugiat eiusmod quis veniam mollit duis officia et laboris."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Reprehenderit exercitation est cupidatat esse mollit aliqua. Commodo ex in excepteur ad qui. Nisi nisi velit non cillum eiusmod in dolor ut pariatur reprehenderit veniam nostrud aute.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Mollit aliquip veniam enim esse."
      },
      {
        "isCorrect": false,
        "text": "Enim ex qui pariatur dolore quis aliquip deserunt cillum ex ullamco."
      },
      {
        "isCorrect": false,
        "text": "Lorem in cillum amet culpa enim."
      },
      {
        "isCorrect": true,
        "text": "Lorem proident minim aute adipisicing magna laboris excepteur fugiat tempor consectetur ipsum."
      },
      {
        "isCorrect": false,
        "text": "Duis commodo officia ad consequat tempor eiusmod magna consequat."
      }
    ],
    "difficulty": 0,
    "text": "Proident nisi sunt quis incididunt eiusmod aliquip nostrud non consequat excepteur esse velit consectetur laboris.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Incididunt incididunt nostrud est voluptate."
      },
      {
        "isCorrect": true,
        "text": "Eiusmod officia eiusmod laborum irure."
      },
      {
        "isCorrect": true,
        "text": "Eu non laboris dolore nostrud."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Laboris in in aliquip labore fugiat magna enim id velit aute adipisicing cillum exercitation laborum. Velit veniam et aliquip eu nulla exercitation ullamco excepteur ea est in veniam. Lorem tempor ullamco dolor qui nostrud ea exercitation tempor Lorem veniam qui.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Occaecat mollit officia magna do sint esse eiusmod sit incididunt dolore ullamco et amet."
      },
      {
        "isCorrect": false,
        "text": "Enim eu adipisicing enim deserunt ea laboris magna nisi veniam aliquip reprehenderit."
      },
      {
        "isCorrect": false,
        "text": "Aute laborum excepteur anim ex dolore nulla enim id adipisicing laborum nisi exercitation aliqua cupidatat."
      },
      {
        "isCorrect": true,
        "text": "Ipsum enim adipisicing velit incididunt consequat culpa laborum pariatur et cupidatat quis magna."
      },
      {
        "isCorrect": false,
        "text": "Aute amet est id ipsum qui veniam laborum sunt."
      },
      {
        "isCorrect": false,
        "text": "Sit fugiat non cupidatat duis incididunt incididunt deserunt aliqua consequat ut adipisicing laboris aliquip deserunt."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Labore veniam dolore sint reprehenderit tempor quis dolor quis minim nisi id.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Dolore occaecat veniam ea laboris in nulla elit laboris ut ad exercitation sit ad."
      },
      {
        "isCorrect": true,
        "text": "Reprehenderit Lorem culpa nostrud duis labore et sint ea cupidatat cupidatat nostrud do dolor cillum."
      },
      {
        "isCorrect": false,
        "text": "Amet commodo aliqua aliquip cupidatat laboris sunt cillum cillum."
      },
      {
        "isCorrect": false,
        "text": "Id sit deserunt officia esse in aliqua ullamco cillum ea."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Deserunt deserunt eu et do amet nostrud veniam. Qui duis laboris mollit ut ipsum proident mollit. Magna dolore ad deserunt sunt. Aliquip excepteur deserunt eu et elit adipisicing amet aute magna commodo.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Velit eiusmod excepteur cupidatat excepteur quis fugiat ipsum ea aliqua laboris enim consectetur."
      },
      {
        "isCorrect": true,
        "text": "In ad fugiat occaecat laborum occaecat proident reprehenderit veniam adipisicing Lorem incididunt."
      },
      {
        "isCorrect": true,
        "text": "Excepteur fugiat consectetur consequat sit non do ut magna fugiat nulla veniam adipisicing."
      },
      {
        "isCorrect": true,
        "text": "Ex ad est ex ea."
      },
      {
        "isCorrect": true,
        "text": "Reprehenderit ex veniam ad adipisicing anim deserunt amet elit."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Adipisicing aute tempor cillum labore nostrud minim ut exercitation veniam Lorem elit.",
    "subject": "Java"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Officia id in incididunt pariatur ex eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Proident qui fugiat laborum ipsum anim sunt et mollit ad sint elit non officia."
      },
      {
        "isCorrect": false,
        "text": "Elit velit cupidatat Lorem minim anim enim sunt aute minim."
      }
    ],
    "difficulty": 2,
    "text": "Ea dolor irure amet Lorem deserunt. Ullamco ipsum ipsum est aliqua elit cupidatat sint duis adipisicing. Mollit labore esse labore in proident do nulla. Ad laboris quis officia laboris minim ullamco deserunt incididunt veniam Lorem anim consectetur officia. Elit nisi commodo eu veniam labore commodo esse anim ullamco ex.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Officia mollit excepteur magna ut eiusmod occaecat est."
      },
      {
        "isCorrect": false,
        "text": "Ea laboris fugiat veniam esse eu esse eiusmod."
      },
      {
        "isCorrect": true,
        "text": "Ullamco sit dolor culpa labore elit."
      },
      {
        "isCorrect": false,
        "text": "Exercitation consectetur amet velit culpa."
      },
      {
        "isCorrect": false,
        "text": "Sint anim esse culpa commodo minim tempor minim sit."
      },
      {
        "isCorrect": true,
        "text": "Elit ullamco sunt incididunt reprehenderit duis pariatur proident ex culpa fugiat ea enim velit ad."
      }
    ],
    "difficulty": 3,
    "text": "Culpa commodo ex amet velit consequat ipsum sint culpa reprehenderit. Tempor labore est nisi id sunt eu culpa nulla ex enim sint proident. Amet nisi tempor eu aute. Ad do est non sit sunt eu minim amet proident ut sint laboris aliquip. Ipsum laboris ullamco culpa voluptate.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Consequat aute non tempor cillum."
      },
      {
        "isCorrect": true,
        "text": "Quis irure tempor eiusmod ullamco."
      },
      {
        "isCorrect": false,
        "text": "Adipisicing incididunt ipsum nulla aliqua."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Enim consequat et proident in mollit aute amet ullamco dolor. Ipsum occaecat dolor eu mollit. Ullamco labore consectetur qui minim nisi deserunt aute laboris aute occaecat elit cupidatat proident.",
    "subject": "Clojure"
  },
  {
    "answers": [
      {
        "isCorrect": false,
        "text": "Lorem velit aliqua cupidatat qui anim veniam aute."
      },
      {
        "isCorrect": true,
        "text": "Voluptate Lorem sunt veniam deserunt."
      },
      {
        "isCorrect": true,
        "text": "Anim elit aute ipsum mollit mollit non."
      }
    ],
    "difficulty": 2,
    "code": "demo-code",
    "text": "Tempor adipisicing enim aliqua nostrud duis commodo deserunt mollit ad Lorem velit exercitation.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ad id consectetur amet mollit veniam deserunt."
      },
      {
        "isCorrect": false,
        "text": "Lorem sint laboris id do ad aliqua."
      },
      {
        "isCorrect": true,
        "text": "Et aute excepteur excepteur dolor elit commodo ullamco qui eu non mollit."
      },
      {
        "isCorrect": false,
        "text": "Esse esse in anim sit tempor deserunt amet est velit nulla anim sit pariatur."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Veniam labore enim est est dolor laboris exercitation voluptate velit id exercitation aliquip nostrud.",
    "subject": "JavaScript"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Laborum ullamco do irure ut cillum enim deserunt cillum."
      },
      {
        "isCorrect": false,
        "text": "Est qui ex reprehenderit et."
      },
      {
        "isCorrect": false,
        "text": "Eiusmod ea ullamco do quis ea ad veniam."
      }
    ],
    "difficulty": 1,
    "code": "demo-code",
    "text": "Quis sunt non mollit sint dolor culpa velit occaecat officia eu aliquip.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Anim mollit excepteur ipsum veniam amet qui non esse occaecat."
      },
      {
        "isCorrect": false,
        "text": "Id qui labore consequat aute qui do Lorem tempor deserunt Lorem dolore amet et."
      },
      {
        "isCorrect": false,
        "text": "Laboris ullamco eu pariatur aliqua ipsum velit veniam sint eiusmod excepteur esse quis qui."
      },
      {
        "isCorrect": true,
        "text": "Qui excepteur exercitation labore pariatur sit et culpa ea deserunt voluptate."
      },
      {
        "isCorrect": false,
        "text": "Adipisicing sit non amet fugiat."
      },
      {
        "isCorrect": false,
        "text": "Consectetur nisi elit duis officia aliquip aliqua aliqua pariatur enim."
      },
      {
        "isCorrect": true,
        "text": "Ipsum laboris laborum sunt nostrud laborum ut qui ipsum cupidatat nulla consectetur ea."
      },
      {
        "isCorrect": false,
        "text": "Incididunt eu eu consectetur non minim."
      },
      {
        "isCorrect": false,
        "text": "Esse mollit et anim aliqua ipsum dolore mollit."
      },
      {
        "isCorrect": true,
        "text": "Laboris eu laboris Lorem ea deserunt dolore sunt ea id ex minim."
      }
    ],
    "difficulty": 0,
    "text": "Ea sit fugiat do consectetur proident cillum nostrud minim tempor nostrud duis.",
    "subject": "Scala"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Duis commodo labore eu culpa ea."
      },
      {
        "isCorrect": true,
        "text": "Minim magna consectetur ipsum voluptate culpa voluptate incididunt anim pariatur nulla."
      },
      {
        "isCorrect": true,
        "text": "Sit non veniam commodo magna consectetur proident esse consectetur exercitation fugiat."
      },
      {
        "isCorrect": true,
        "text": "Sit cillum id anim fugiat occaecat exercitation."
      },
      {
        "isCorrect": false,
        "text": "Laborum sit laborum amet pariatur fugiat commodo quis ipsum ea ad."
      },
      {
        "isCorrect": false,
        "text": "Reprehenderit sit deserunt sunt occaecat ea."
      },
      {
        "isCorrect": true,
        "text": "Tempor aute enim esse fugiat non fugiat magna officia aliqua."
      }
    ],
    "difficulty": 3,
    "code": "demo-code",
    "text": "Ut incididunt dolor excepteur fugiat tempor esse. Anim exercitation elit sit non Lorem nisi culpa eiusmod excepteur tempor. Ut dolore nostrud minim commodo sunt et aliqua fugiat laborum culpa labore aliqua consectetur ut. Pariatur ut aute enim culpa esse ipsum tempor sit velit aute dolor pariatur. Reprehenderit voluptate laborum reprehenderit magna laborum laboris id sit. Quis exercitation aute pariatur nisi.",
    "subject": "Android"
  },
  {
    "answers": [
      {
        "isCorrect": true,
        "text": "Ex exercitation labore incididunt veniam minim."
      },
      {
        "isCorrect": true,
        "text": "Occaecat incididunt commodo commodo duis occaecat cupidatat nulla mollit esse velit deserunt do cillum mollit."
      },
      {
        "isCorrect": false,
        "text": "Nostrud consequat aute reprehenderit est eu est aliqua esse amet ipsum ea qui occaecat."
      },
      {
        "isCorrect": true,
        "text": "Ullamco elit sint proident commodo ipsum fugiat culpa Lorem consectetur labore incididunt eu ullamco qui."
      },
      {
        "isCorrect": true,
        "text": "Quis qui amet officia exercitation excepteur cillum est dolor ipsum."
      },
      {
        "isCorrect": false,
        "text": "Cupidatat sit dolore aliquip do in non."
      },
      {
        "isCorrect": false,
        "text": "Quis dolor ad consequat minim aliqua."
      },
      {
        "isCorrect": true,
        "text": "Proident voluptate incididunt ut officia fugiat ullamco incididunt commodo id."
      },
      {
        "isCorrect": false,
        "text": "Dolore ut anim pariatur enim officia."
      },
      {
        "isCorrect": true,
        "text": "Fugiat ea qui do qui ad."
      }
    ],
    "difficulty": 0,
    "code": "demo-code",
    "text": "Id dolor magna eu laboris eu labore irure dolore. Ea sint proident sint culpa. Eiusmod est labore dolor labore mollit deserunt laborum irure eiusmod sunt quis sint sint occaecat. Aliquip mollit nostrud aliqua Lorem consectetur nisi eiusmod aliquip. Nisi est ea exercitation enim ea fugiat labore veniam culpa excepteur eiusmod. Dolore adipisicing enim aliqua Lorem est.",
    "subject": "Scala"
  }
]
